#scala #data-structures 
# Scala Lists
In Scala, *lists* are defined in the standard library `scala`. 
A list with elements `x1, ..., xN` is written `List(x1, ..., xN)`.

There are two important differences between lists and *arrays* which are written `Array(x1, ..., xN)`:
1. Lists are immutable - their elements cannot be changed
2. Lists are recursive, while arrays are flat.

## The List Type
The type of a list with elements of type `T` is `scala.List[T]` or shorter, `List[T]`.

## List Constructors
Lists can be constructed with the following syntax:
```Scala
> val fruits = List("apples", "bananas", "oranges")
  -> val fruits: List[String] = List(apples, bananas, oranges)

> val nums = List(1, 2, 3)
  -> val nums: List[Int] = List(1, 2, 3)
```

However, below the hood, lists are constructed using the *Cons-Nil* structure, which is why it can also be used directly:
```Scala
> val fruits = "apples" :: ("oranges" :: ("pears" :: Nil))
  -> val fruits: List[String] = List(apples, oranges, pears)

> val nums = 1 :: (2 :: (3 :: Nil))
  -> val nums: List[Int] = List(1, 2, 3)
```

### The `::` operator
#terminology 

In the above example the `::` operator (pronounced *cons*) was used to construct a list. In general, such operators that end in `:` associate to the right, thus:
```
A :: B :: C   =>   A :: (B :: C)
```
Which means we can omit the parentheses in the above examples:
```Scala
> val nums = 1 :: 2 :: 3 :: Nil
  -> val nums: List[Int] = List(1, 2, 3)
```

## Operations on Lists
All list operations can be expressed in terms of the following three:
- `head` -> the first element of the list
- `tail` -> the list of all elements except the first
- `isEmpty`

Lists can be easily decomposed using [[3.3 Pattern Matching, Enums#Pattern Matching|pattern matching]], thanks to their structure.
The most useful patterns are:

| Pattern | Meaning |
| --- | --- |
| `Nil` | an empty list |
| `h :: t` | a list with a head matching `h` and a tail matching `t` |
| `List(x1, ..., xN)` | a list with `n` elements matching `x1, ..., xN` |

**Examples:**
- `1 :: 2 :: t` matches lists that start with `1` then `2`.
- `x :: Nil` matches lists with length 1, equivalent to `List(x)`
- `List(2 :: t)` matches a list with its only element being another list which starts with `2`.

We can use this to design a function which performs *insertion sort* on lists of integers:
```Scala
def insertionSort(xs: List[Int]): List[Int] = xs match
	case Nil     => Nil
	case y :: ys => insert(y, insertionSort(ys))

	def insert(x: Int, xs: List[Int]): List[Int] = xs match
		case Nil     => x :: Nil
		case y :: ys => if x < y then x :: xs else y :: insert(x, ys)
```
Remark: this has asymptotic worst-case complexity of `O(N * N)`. yikes.

### List Methods
#terminology 

The following tables shows the most commonly used methods defined on `List`:

**Sublists and element access**
For a list `xs` and an integer `n`. Methods annotated with a `*` throw an exception if called on an empty list.

| Method | Definition |
| ------ | ---------- |
| `xs.length` | The number of elements of `xs`. |
| `xs.last` | The last element of `xs`. * |
| `xs.init` | A list of all elements of `xs` except the last one. * |
| `xs.take(n)` | A list consisting of the first `n` elements of `xs`. |
| `xs.drop(n)` | The rest of `xs` after having taken `n` elements. |
| `xs(n)` | The element of `xs` at index `n`. Equivalent to `xs.apply(n)`. |

**Creating new lists**
For lists `xs` and `ys`, an integer `n` and a value `x` of the same type as the list elements in `xs`.

| Method | Definition |
| ------ | ---------- |
| `xs ++ ys` | A list of all elements of `xs` followed by all elements of `ys`. |
| `xs.reverse` | A list of all elements of `xs` in reversed order. |
| `xs.updated(n, x)` | A list identical to `xs`, containing `x` at index `n`. |

**Finding elements**
For a list `xs` and a value `x` of the same type as the elements in `xs`.

| Method | Definition |
| ------ | ---------- |
| `xs.indexOf(x)` | The index of the first occurrence of `x` in `xs` or `-1`. |
| `xs.contains(x)` | Equivalent to `xs.indexOf(x) >= 0`. |

# Scala Tuples
A pair consisting of `x` and `y` is written `(x, y)` in Scala. The types of the two elements can be different or the same:
```Scala
> val pair = ("answer", 42)
  -> val pair: (String, Int) = (answer,42)
```
Pairs can then also be used as patterns:
```Scala
> val (label, value) = pair
  -> val label: String = answer
	 val value: Int = 42
```

This extends analogously to *tuples* with more than two elements:
```Scala
> val triplet = (true, 1, 'a')
  -> val triplet: (Boolean, Int, Char) = (true,1,a)
```
To access the n<sup>th</sup> element of a tuple, the syntax `._n` is used:
```Scala
> triplet._3
  -> val res0: Char = a
```
Notice that these are not 0-indexed.

A good example of the usage of tuples about *merge sort* can be found on [[scala-week4.pdf#page=104|slides 104 - 112]].